# Roughness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Segment..::..Roughness Property
Segment Class See Also
---
The roughness value for given material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Roughness { get; set; }
```

Visual Basic
---
```text
Public Property Roughness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Roughness {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
Segment Class
Autodesk.Revit.DB Namespace